app/views/devices/_form.html.haml

        %tbody
          - current_user.devices.each do |device|
---
SELECT `devices`.* FROM `devices` WHERE `devices`.`user_id` = 1