app/controllers/devices_controller.rb

SELECT `devices`.* FROM `devices`
---
  def index
    @devices = Device.all

INSERT INTO `devices` (`external_id`, `name`, `user_id`, `created_at`, `updated_at`) VALUES ('2c0048001747343337363432', 'Garage 1', 1, '2016-10-06 18:12:09', '2016-10-06 18:12:09')
---
  def create
    @device = Device.new(device_params)
    @device.user_id = @device.user_id || current_user.id

    respond_to do |format|
      if @device.save

DELETE FROM `devices` WHERE `devices`.`id` = 1
---
  def destroy
    @device.destroy

SELECT  `devices`.* FROM `devices` WHERE `devices`.`id` = 1 LIMIT 1
---
    def set_device
      @device = Device.find(params[:id])