app/controllers/ios_controller.rb

  def create
    @io = Io.new(io_params)

    respond_to do |format|

      @profile.ios << @io
---
INSERT INTO `ios_profiles` (`io_id`, `profile_id`) VALUES (1, 1)