app/controllers/profiles_controller.rb

INSERT INTO `profiles` (`name`, `created_at`, `updated_at`) VALUES ('My House', '2016-10-07 16:51:09', '2016-10-07 16:51:09')
---
  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save